[
    {
        "id": "1",
        "name": "IoT Developer Intern",
        "description": "Intern | Hybrid | Kelaniya",
        "icon": "https://your-website.com/path-to-icon-webdev.svg",
        "image": "IoT-Post-2.png",
        "roleOverview": "We are looking for IoT Developers Intern to join our team!",
        "keyResponsibilities": [
            "🔧 Assist in the development, testing, and deployment of IoT solutions",
            "🔧 Work with microcontrollers, sensors, and communication protocols",
            "🔧 Troubleshoot and debug IoT hardware and software issues",
            "🔧 Collaborate with the team to develop innovative IoT applications",
            "🔧 Assist in mobile (Android/Flutter) & web dashboard development for IoT data visualization and monitoring"
        ],
        "qualifications": [
            "✅ Currently enrolled Degree in Electronics, Computer Science, or IT related field",
            "✅ Basic knowledge of electronics",
            "✅ Basic knowledge of IoT devices, microcontrollers (ESP8266, ESP32, Arduino, Raspberry Pi), and sensors",
            "✅ Familiarity with programming languages such as Python, C, or C++",
            "✅ Understanding of communication protocols (MQTT, HTTP, Wi-Fi, Bluetooth)",
            "✅ Experience working with Firebase",
            "✅ Familiarity with mobile (Android/Flutter) & web dashboard development for IoT systems",
            "✅ Added advantage: Experience with Flask and AI Integration with IoT",
            "✅ Strong problem-solving skills and eagerness to learn",
            "✅ Ability to work independently and as part of a team"
        ],
        "whyJoinUs": [
            "🌟 Gain real-world IoT development experience",
            "🌟 Be part of a fast-growing technology-driven company",
            "🌟 Work on innovative and impactful projects",
            "🌟 Opportunity for professional growth and development"
        ],
        "apply": [
            "Send your CV, university-issued Internship Placement Request Letter, and any IoT-related project details or certifications."
        ]
    }
]
