[
    {
        "id": "1",
        "name": "3D Product Designer",
        "description": "Contract | Remote",
        "icon": "https://your-website.com/path-to-icon-ai.svg",
        "image": "3D_Product_Designer.png",
        "roleOverview": "We are looking for a creative 3D Product Designer to join our team!",
        "keyResponsibilities": [
            "📌 Design high-quality 3D models for consumer products, enclosures, and mechanical parts",
            "📌 Prepare 3D printable files (STL, STEP, OBJ) optimized for FDM/SLA printing",
            "📌 Collaborate with hardware and electronics teams to ensure fit and function",
            "📌 Create visual mockups, product renders, and working prototypes",
            "📌 Assist in product iterations based on testing and client feedback",
            "📌 Ensure models meet manufacturing constraints and 3D printer tolerances",
            "📌 Maintain organized versioning of designs and project documentation"
        ],
        "qualifications": [
            "✅ Proven experience with Fusion 360, SolidWorks, or Blender",
            "✅ Strong understanding of 3D printing design principles",
            "✅ Ability to design functional parts, enclosures, and assemblies",
            "✅ Familiarity with FDM/SLA printing and slicing software (e.g., Cura, Bambu Studio)",
            "✅ Proficiency in creating dimensionally accurate and optimized models",
            "✅ Experience in rendering and visualization is a plus",
            "✅ Bonus: Knowledge of electronics and integration with PCBs, microcontrollers, sensors etc.",
            "✅ Creativity, attention to detail, and the ability to iterate quickly"
        ],
        "whyJoinUs": [
            "🌟 Work on real-world product development projects",
            "🌟 Get hands-on with 3D printers, prototyping tools, and production workflows",
            "🌟 Collaborate with cross-functional teams including AI, IoT developers",
            "🌟 Enhance your skills in a supportive and innovation-driven environment",
            "🌟 See your designs come to life from concept to physical product"
        ],
        "apply": [
            "Send your CV and Portfolio (3D models, renders, or STL samples) project details or certifications."
        ]
    }
]