[
  {
      "id": "1",
      "name": "Web Development",
      "description": "We specialize in creating responsive and high-performance websites using cutting-edge technologies like React, Node.js, Laravel, and Vue.js. From intuitive user interfaces to powerful backends, we craft tailored solutions to meet your unique business needs.",
      "image": "/service-web-development.png"
  },
  {
      "id": "2",
      "name": "IoT",
      "description": "Connect your devices for smarter living with our IoT solutions. We offer end-to-end services, from hardware integration to software development, enabling seamless automation and enhanced connectivity for homes and industries alike.",
      "image": "/Service-IoT.png"
  },
  {
      "id": "3",
      "name": "AI & Machine Learning",
      "description": "Empower your business with AI-driven insights and automation. From predictive analytics to custom ML models, we help you harness the power of AI to make smarter decisions and improve efficiency.",
      "image": "/Services.png"
  },
  {
      "id": "4",
      "name": "Mobile App Development",
      "description": "Bring your ideas to life with our bespoke mobile app development services. We build feature-rich, user-friendly applications for Android and iOS, ensuring exceptional performance and seamless user experiences.",
      "image": "/service-app-development.png"
  },
  {
      "id": "5",
      "name": "Desktop Applications Development",
      "description": "Streamline operations with custom desktop applications tailored to your workflows. Whether for business or personal use, we deliver robust and scalable solutions to meet your needs.",
      "image": "/service-software-development.png"
  },
  {
      "id": "6",
      "name": "Graphic Design",
      "description": "Enhance your brand with visually striking graphic designs. From logos to marketing materials, our creative team ensures your business stands out with unique and professional designs.",
      "image": "/Services.png"
  },
  {
      "id": "7",
      "name": "UI/UX Design",
      "description": "Deliver a memorable user experience with our UI/UX design services. We create intuitive, aesthetically pleasing interfaces that improve engagement and usability for web and mobile applications.",
      "image": "/service-uiux.png"
  },
  {
      "id": "8",
      "name": "3D Modeling & 3D Printing",
      "description": "Transform your ideas into reality with our 3D modeling and 3D printing services. Whether for prototyping, customized products, or artistic designs, we provide precision and quality at every step.",
      "image": "/Services.png"
  },
  {
      "id": "9",
      "name": "Zfrozen Solar",
      "description": "Power your future with our expert solar solutions. From design and installation to maintenance, we provide comprehensive solar energy systems tailored for residential and commercial needs.",
      "image": "/Services.png"
  }
]
